hulei123/git123/apps/bus_pal/MKV46F15/dspi/src/fsl_dspi_edma_slave_driver.c
/*
 * Copyright (c) 2013 - 2014, Freescale Semiconductor, Inc.
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * o Redistributions of source code must retain the above copyright notice, this list
 *   of conditions and the following disclaimer.
 *
 * o Redistributions in binary form must reproduce the above copyright notice, this
 *   list of conditions and the following disclaimer in the documentation and/or
 *   other materials provided with the distribution.
 *
 * o Neither the name of Freescale Semiconductor, Inc. nor the names of its
 *   contributors may be used to endorse or promote products derived from this
 *   software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND
 * ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
 * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR
 * ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
 * (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
 * LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON
 * ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
 * (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
 * SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

#include <string.h>
#include <assert.h>
#include "fsl_dspi_edma_slave_driver.h"
#include "fsl_clock_manager.h"
#include "fsl_interrupt_manager.h"

/*******************************************************************************
 * Definitions
 ******************************************************************************/
/*!
 * @brief Flags of DSPI slave event.
 *
 * DSPI event used to notify user that it finishes the task.
 */
typedef enum _dspi_edma_event_flags {
    kDspiEdmaTransferDone = 0x01,         /*!< Transferring done flag */
} dspi_edma_event_flag_t;

/*******************************************************************************
 * Variables
 ******************************************************************************/
/*! @brief Table of base addresses for DSPI instances. */
extern const uint32_t g_dspiBaseAddr[];

/*! @brief Table to save DSPI IRQ enum numbers defined in CMSIS header file. */
extern const IRQn_Type g_dspiIrqId[SPI_INSTANCE_COUNT];

/* Pointer to runtime state structure.*/
extern void * g_dspiStatePtr[SPI_INSTANCE_COUNT];

/*******************************************************************************
 * Code
 ******************************************************************************/

/*!
 * @brief DSPI receive done callback function
 * @details This function is called when receiving is done.
 *
 * @param param pointer to parameter
 * @param status current status of eDMA channel
 */
static void DSPI_DRV_EdmaRxCallback(void *param, edma_chn_status_t status);

/*!
 * @brief DSPI transmit done callback function
 * @details This function is called when transmitting is done.
 *
 * @param param pointer to parameter
 * @param status current status of eDMA channel
 */
static void DSPI_DRV_EdmaTxCallback(void *param, edma_chn_status_t status);

/*!
 * @brief Finish the current DSPI transfer
 * @details This function stop the DSPI transfer
 *
 * @param instance The instance of DSPI hardware
 */
static void DSPI_DRV_EdmaCompleteTransfer(uint32_t instance);

/*!
 * @brief Start slave transferring.
 * @details This function make starting the transfer.
 *
 * @param instance The instance number of DSPI peripheral
 * @param sendBuffer The pointer to transmit buffer
 * @param receiveBuffer The pointer to receive buffer
 * @param transferByteCount The transfer size
 */
static void DSPI_DRV_EdmaSlaveStartTransfer(uint32_t instance,
                                            const uint8_t *sendBuffer,
                                            uint8_t *receiveBuffer,
                                            uint32_t transferByteCount);

/*FUNCTION**********************************************************************
 *
 * Function Name : DSPI_DRV_EdmaSlaveInit
 * Description   : Initialize a DSPI slave instance.
 * Un-gate DSPI's clock, setup the default value and initializes the required
 * resources.
 *
 *END**************************************************************************/
dspi_status_t DSPI_DRV_EdmaSlaveInit(uint32_t instance,
                                     dspi_edma_slave_state_t * dspiState,
                                     const dspi_edma_slave_user_config_t * slaveConfig)
{
    dspi_status_t result = kStatus_DSPI_Success;
    dma_request_source_t dspiTxEdmaRequest = kDmaRequestMux0Disable;
    dma_request_source_t dspiRxEdmaRequest = kDmaRequestMux0Disable;
    uint32_t baseAddr = g_dspiBaseAddr[instance];

    // Check the instance, eDMA only support SPI0
    if (instance != 0)
    {
        return kStatus_DSPI_OutOfRange;
    }

    // Check parameter pointer is not NULL
    if ((dspiState == NULL) || (slaveConfig == NULL))
    {
        return kStatus_DSPI_InvalidParameter;
    }

    // Check DSPI slave instance is already initialized
    if (g_dspiStatePtr[instance])
    {
        return kStatus_DSPI_Initialized;
    }

    // Check if bits/frame is 3 bytes, eDMA driver does not support 3bytes copy at a time.
    if ((16 < slaveConfig->dataConfig.bitsPerFrame) && (slaveConfig->dataConfig.bitsPerFrame <= 24))
    {
        return kStatus_DSPI_OutOfRange;
    }

    // Check bits/frame number
    if (slaveConfig->dataConfig.bitsPerFrame > 32)
    {
        return kStatus_DSPI_OutOfRange;
    }

    // Clear the run-time state struct for this instance.
    memset(dspiState, 0, sizeof(* dspiState));

    // Initial default value slave state structure
    dspiState->status = kStatus_DSPI_Success;
    dspiState->errorCount = 0;
    dspiState->dummyPattern = slaveConfig->dummyPattern;
    dspiState->remainingSendByteCount = 0;
    dspiState->remainingReceiveByteCount = 0;
    dspiState->isTransferInProgress = false;
    dspiState->extraReceiveByte = 0;

    if (kStatus_OSA_Success != OSA_EventCreate(&dspiState->event, kEventAutoClear))
    {
        // Create event error
        dspiState->status = kStatus_DSPI_Error;
        return kStatus_DSPI_Error;
    }

    // configure the run-time state struct with the nubmer of bits/frame
    dspiState->bitsPerFrame = slaveConfig->dataConfig.bitsPerFrame;

    // Enable clock for DSPI
    CLOCK_SYS_EnableSpiClock(instance);

