hulei123/git123/apps/bus_pal/MKV46F15/dspi/src/fsl_dspi_edma_slave_driver.c
    // Reset the DSPI module, which also disables the DSPI module
    DSPI_HAL_Init(baseAddr);

    // Set to slave mode.
    DSPI_HAL_SetMasterSlaveMode(baseAddr, kDspiSlave);

    // Set slave data format
    result = DSPI_HAL_SetDataFormat(baseAddr, kDspiCtar0, &slaveConfig->dataConfig);

    // Enable fifo operation (regardless of FIFO depth)
    DSPI_HAL_SetFifoCmd(baseAddr, true, true);

    // flush the fifos
    DSPI_HAL_SetFlushFifoCmd(baseAddr, true, true);

    switch (instance)
    {
        case 0:
            // SPI0
            dspiRxEdmaRequest = kDmaRequestMux0SPI0Rx;
            dspiTxEdmaRequest = kDmaRequestMux0SPI0Tx;
            break;
        case 1:
            // SPI1
            break;
        default :
            break;
    }

    // This channel transfers data from RX FIFO to receiveBuffer
    if (kEDMAInvalidChannel == EDMA_DRV_RequestChannel(kEDMAAnyChannel,
                                                       dspiRxEdmaRequest,
                                                       &dspiState->edmaRxChannel))
    {
        dspiState->status = kStatus_DSPI_Error;
        return kStatus_DSPI_DMAChannelInvalid;
    }

    // This channel transfers data from transmitBuffer to TX FIFO
    if (kEDMAInvalidChannel == EDMA_DRV_RequestChannel(kEDMAAnyChannel,
                                                       dspiTxEdmaRequest,
                                                       &dspiState->edmaTxChannel))
    {
        dspiState->status = kStatus_DSPI_Error;
        return kStatus_DSPI_DMAChannelInvalid;
    }

    // Configure IRQ state structure, so irq handler can point to the correct state structure
    g_dspiStatePtr[instance] = dspiState;

    // Enable the interrupt
    INT_SYS_EnableIRQ(g_dspiIrqId[instance]);

    // DSPI module enable
    DSPI_HAL_Enable(baseAddr);

    return result;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : DSPI_DRV_EdmaSlaveDeinit
 * Description   : Shutdown a DSPI instance.
 * Resets the DSPI peripheral, disables the interrupt to the core, and gates its clock.
 *
 *END**************************************************************************/
void DSPI_DRV_EdmaSlaveDeinit(uint32_t instance)
{
    uint32_t baseAddr = g_dspiBaseAddr[instance];
    dspi_edma_slave_state_t * dspiState = (dspi_edma_slave_state_t *)g_dspiStatePtr[instance];

    // Validate function parameters
    assert(instance < SPI_INSTANCE_COUNT);

    if (!dspiState)
    {
        return;
    }

    // disable the interrupt
    INT_SYS_DisableIRQ(g_dspiIrqId[instance]);

    // Stop the transfer process in the slave
    DSPI_HAL_StopTransfer(baseAddr);

    // Wait until the DSPI run status signals that is has halted before shutting
    // down the module and before gating off the DSPI clock source.  Otherwise, if the DSPI
    // is shut down before it has halted it's internal processes, it may be left in an unknown
    // state.
    // Note that if the master slave select is still asserted, the run status will never clear.
    // Hence, ensure before shutting down the slave that the master has de-asserted the slave
    // select signal (it should be high if slave select active low or it should be low if
    // slave select is active high).
    while((DSPI_HAL_GetStatusFlag(baseAddr, kDspiTxAndRxStatus))) { }

    // Restore the module to defaults then power it down. This also disables the DSPI module.
    DSPI_HAL_Init(baseAddr);

    // Gate the clock for DSPI.
    CLOCK_SYS_DisableSpiClock(instance);

    // Destroy event
    OSA_EventDestroy(&dspiState->event);

    EDMA_DRV_ReleaseChannel(&dspiState->edmaTxChannel);
    EDMA_DRV_ReleaseChannel(&dspiState->edmaRxChannel);

    dspiState->status = kStatus_DSPI_NonInit;

    // Clear state pointer.
    g_dspiStatePtr[instance] = NULL;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : DSPI_DRV_EdmaSlaveStartTransfer
 * Description   : Starts transfer data on SPI bus using eDMA and non-blocking call
 * Start DSPI transfering, update transmit/receive information into slave state structure
 *
 *END**************************************************************************/
static void DSPI_DRV_EdmaSlaveStartTransfer(uint32_t instance,
                                            const uint8_t *sendBuffer,
                                            uint8_t *receiveBuffer,
                                            uint32_t transferByteCount)
{
    uint32_t dmaInstance, dmaChannel;
    uint32_t majorIteration;
    uint32_t baseAddr = g_dspiBaseAddr[instance];
    dspi_edma_slave_state_t * dspiState = (dspi_edma_slave_state_t *)g_dspiStatePtr[instance];
    uint8_t nBytes = dspiState->bitsPerFrame / 8;

    // Calculate number of bytes in frame
    if (dspiState->bitsPerFrame % 8 != 0)
    {
        nBytes ++;
    }

    // Stop the transfer first
    DSPI_HAL_StopTransfer(baseAddr);

    // Reset the transfer counter to 0.
    DSPI_HAL_PresetTransferCount(baseAddr, 0);

    // flush the fifos
    DSPI_HAL_SetFlushFifoCmd(baseAddr, true, true);

    // Clear DSPI flags
    DSPI_HAL_ClearStatusFlag(baseAddr, kDspiTxComplete);
    DSPI_HAL_ClearStatusFlag(baseAddr, kDspiTxAndRxStatus);
    DSPI_HAL_ClearStatusFlag(baseAddr, kDspiEndOfQueue);
    DSPI_HAL_ClearStatusFlag(baseAddr, kDspiTxFifoUnderflow);
    DSPI_HAL_ClearStatusFlag(baseAddr, kDspiTxFifoFillRequest);
    DSPI_HAL_ClearStatusFlag(baseAddr, kDspiRxFifoOverflow);
    DSPI_HAL_ClearStatusFlag(baseAddr, kDspiRxFifoDrainRequest);

    if (sendBuffer)
    {
        // Configure for transmit

        dmaInstance = VIRTUAL_CHN_TO_EDMA_MODULE_REGBASE(dspiState->edmaTxChannel.channel);
        dmaChannel = VIRTUAL_CHN_TO_EDMA_CHN(dspiState->edmaTxChannel.channel);
        EDMA_HAL_ClearDoneStatusFlag(dmaInstance, (edma_channel_indicator_t)dmaChannel);
        EDMA_HAL_HTCDClearReg(dmaInstance, dmaChannel);

        // Source addr, TX Send buffer
        EDMA_HAL_HTCDSetSrcAddr(dmaInstance, dmaChannel,(uint32_t)(sendBuffer));

        // Source address adjust last: don't increment source address
        EDMA_HAL_HTCDSetSrcLastAdjust(dmaInstance, dmaChannel, 0);


