hulei123/git123/apps/bus_pal/MKV46F15/dspi/src/fsl_dspi_edma_slave_driver.c
        // Destination is the TX FIFO
        EDMA_HAL_HTCDSetDestAddr(dmaInstance, dmaChannel,
                                 DSPI_HAL_GetSlavePushrRegAddr(baseAddr));

        // Dest addr offset don't increment as it is a FIFO
        EDMA_HAL_HTCDSetDestOffset(dmaInstance, dmaChannel, 0);

        // No adjustment needed for destination addr
        EDMA_HAL_HTCDSetDestLastAdjust(dmaInstance, dmaChannel, 0);

        //* The source and destination attributes (bit size) depends on bits/frame setting
        if (dspiState->bitsPerFrame <= 8)
        {
            // Source addr offset is 1 as send buffer pointer is incremented 1 bytes for each write
            EDMA_HAL_HTCDSetSrcOffset(dmaInstance, dmaChannel, 1);

            // Destination size is always one byte, source size varies depending on bits/frame
            EDMA_HAL_HTCDSetAttribute(dmaInstance, dmaChannel,
                                      kEDMAModuloDisable, kEDMAModuloDisable,
                                      kEDMATransferSize_1Bytes, kEDMATransferSize_1Bytes);

            // Transfer 1 byte from RX FIFO to receive buffer
            EDMA_HAL_HTCDSetNbytes(dmaInstance, dmaChannel, 1);

            // Adjust majorIteration to 1 byte per transfer
            majorIteration = transferByteCount;
            dspiState->remainingSendByteCount = transferByteCount;
        }
        // Source size is two bytes
        else if (dspiState->bitsPerFrame <= 16)
        {
            // Source addr offset is 2 as send buffer pointer is incremented 2 bytes for each write
            EDMA_HAL_HTCDSetSrcOffset(dmaInstance, dmaChannel, 2);

            // Destination size is always one byte, source size varies depending on bits/frame
            EDMA_HAL_HTCDSetAttribute(dmaInstance, dmaChannel,
                                      kEDMAModuloDisable, kEDMAModuloDisable,
                                      kEDMATransferSize_2Bytes, kEDMATransferSize_2Bytes);

            // Transfer 2 bytes from transmit buffer to TX FIFO
            EDMA_HAL_HTCDSetNbytes(dmaInstance, dmaChannel, 2);

            // Adjust majorIteration to 2 bytes per transfer
            majorIteration = transferByteCount/2;

            // Adding one more byte if size is odd
            if(transferByteCount % 2 != 0)
            {
                majorIteration ++;
            }
            dspiState->remainingSendByteCount = majorIteration * 2;
        }
        // 3 bytes/frame does not support because eDMA can not copy 3bytes a time.

        // Source size 4 bytes (32-bit)
        else
        {
            // Source addr offset is 4 as send buffer pointer is incremented 4 bytes for each write
            EDMA_HAL_HTCDSetSrcOffset(dmaInstance, dmaChannel, 4);
            // Destination size is always one byte, source size varies depending on bits/frame

            EDMA_HAL_HTCDSetAttribute(dmaInstance, dmaChannel,
                                      kEDMAModuloDisable, kEDMAModuloDisable,
                                      kEDMATransferSize_4Bytes, kEDMATransferSize_4Bytes);

            // Transfer 4 bytes from transmit buffer to TX FIFO */
            EDMA_HAL_HTCDSetNbytes(dmaInstance, dmaChannel, 4);

            // Adjust majorIteration to 4 bytes per transfer
            majorIteration = transferByteCount/4;

            // Adding byte(s) if size is odd
            if(transferByteCount % 4 != 0)
            {
                majorIteration ++;
            }
            dspiState->remainingSendByteCount = majorIteration * 4;
        }
        // Configure CITER and BITER fields and clear the ELINK field (disable channel linking)
        EDMA_HAL_HTCDSetChannelMinorLink(dmaInstance, dmaChannel, 0, false);
        EDMA_HAL_HTCDSetMajorCount(dmaInstance, dmaChannel, majorIteration);

        // Now that the TCD was set up, enable the DSPI Peripheral Hardware request for the
        // TX FIFO
        EDMA_HAL_SetDmaRequestCmd(dmaInstance, (edma_channel_indicator_t)dmaChannel, true);

        // Set up eDMA callback
        // Due to MISRA 11.1 rule:
        // Conversions shall not be performed between a pointer to a function
        // and any type other than an integral type.
        // We first have to typecast the callback function pointer as a uint32_t before typecasting
        // as a void pointer.
        EDMA_DRV_InstallCallback(&dspiState->edmaTxChannel,
                                 DSPI_DRV_EdmaTxCallback,(void *)instance);

        // Enable interrupt
        EDMA_HAL_HTCDSetIntCmd(dmaInstance, dmaChannel, true);

        // Change DSPI status
        dspiState->sendBuffer = sendBuffer;
    }
    else
    {
        // Write known data (zeros) if no source buffer passed in
        DSPI_HAL_WriteDataSlavemode(baseAddr, dspiState->dummyPattern);

        // Transmission FIFO fill request interrupt disable
        DSPI_HAL_SetTxFifoFillDmaIntMode(baseAddr, kDspiGenerateIntReq, false);
    }

    if ((receiveBuffer) && (transferByteCount/nBytes > 0))
    {
        // Configure for receive
        dmaInstance = VIRTUAL_CHN_TO_EDMA_MODULE_REGBASE(dspiState->edmaRxChannel.channel);
        dmaChannel = VIRTUAL_CHN_TO_EDMA_CHN(dspiState->edmaRxChannel.channel);
        EDMA_HAL_ClearDoneStatusFlag(dmaInstance, (edma_channel_indicator_t)dmaChannel);
        EDMA_HAL_HTCDClearReg(dmaInstance, dmaChannel);

        // Source addr, RX FIFO
        EDMA_HAL_HTCDSetSrcAddr(dmaInstance, dmaChannel,
                                DSPI_HAL_GetPoprRegAddr(baseAddr));

        // Source addr offset is 0 as source addr never increments
        EDMA_HAL_HTCDSetSrcOffset(dmaInstance, dmaChannel, 0);

        // Source address adjust last: don't increment source address, it is constant
        EDMA_HAL_HTCDSetSrcLastAdjust(dmaInstance, dmaChannel, 0);

        // Destination is the receive buffer
        EDMA_HAL_HTCDSetDestAddr(dmaInstance, dmaChannel, (uint32_t)(receiveBuffer));

        // No adjustment needed for destination addr for most bits/frame. This field gets
        // updated for the special case of 24-bits/frame
        EDMA_HAL_HTCDSetDestLastAdjust(dmaInstance, dmaChannel, 0);

        // The source and destination attributes (bit size) depends on bits/frame setting
        if (dspiState->bitsPerFrame <= 8)
        {
            // Dest addr offset, always increment to the next byte
            EDMA_HAL_HTCDSetDestOffset(dmaInstance, dmaChannel, 1);

            // Destination size is always one byte, source size varies depending on bits/frame
            EDMA_HAL_HTCDSetAttribute(dmaInstance, dmaChannel,
                                      kEDMAModuloDisable, kEDMAModuloDisable,
                                      kEDMATransferSize_1Bytes, kEDMATransferSize_1Bytes);

            // Transfer 1 byte from RX FIFO to receive buffer
            EDMA_HAL_HTCDSetNbytes(dmaInstance, dmaChannel, 1);

            // Adjust majorIteration to 1 byte per transfer
            majorIteration = transferByteCount;

            // Update remaining receive byte count
            dspiState->remainingReceiveByteCount = transferByteCount;
        }
        else if (dspiState->bitsPerFrame <= 16)
        // Source size is two bytes
        {
            // Dest addr offset, always increment to the next byte
            EDMA_HAL_HTCDSetDestOffset(dmaInstance, dmaChannel, 2);

            // Destination size is always one byte, source size varies depending on bits/frame
            EDMA_HAL_HTCDSetAttribute(dmaInstance, dmaChannel,
                                      kEDMAModuloDisable, kEDMAModuloDisable,
                                      kEDMATransferSize_2Bytes, kEDMATransferSize_2Bytes);

            // Transfer 2 bytes from RX FIFO to receive buffer
            EDMA_HAL_HTCDSetNbytes(dmaInstance, dmaChannel, 2);

