hulei123/git123/apps/bus_pal/MKV46F15/dspi/src/fsl_dspi_edma_slave_driver.c
            // Adjust majorIteration to 2 bytes per transfer
            majorIteration = transferByteCount/2;

            // Update remaining receive byte count
            dspiState->remainingReceiveByteCount = majorIteration * 2;

            // Calculate the receive extra bytes
            dspiState->extraReceiveByte = transferByteCount - dspiState->remainingReceiveByteCount;
        }
        else
        // Source size 4 bytes (32-bit)
        {
            // Dest addr offset, always increment to the next byte
            EDMA_HAL_HTCDSetDestOffset(dmaInstance, dmaChannel, 4);

            // Destination size is always one byte, source size varies depending on bits/frame
            EDMA_HAL_HTCDSetAttribute(dmaInstance, dmaChannel,
                                      kEDMAModuloDisable, kEDMAModuloDisable,
                                      kEDMATransferSize_4Bytes, kEDMATransferSize_4Bytes);

            // Transfer 4 bytes from RX FIFO to receive buffer
            EDMA_HAL_HTCDSetNbytes(dmaInstance, dmaChannel, 4);

            // Adjust majorIteration to 4 bytes per transfer
            majorIteration = transferByteCount/4;

            // Update remaining receive byte count
            dspiState->remainingReceiveByteCount = majorIteration * 4;

            // Calculate the receive extra bytes
            dspiState->extraReceiveByte = transferByteCount - dspiState->remainingReceiveByteCount;
        }

        // Configure CITER and BITER fields and clear the ELINK field (disable channel linking)
        EDMA_HAL_HTCDSetChannelMinorLink(dmaInstance, dmaChannel, 0, false);
        EDMA_HAL_HTCDSetMajorCount(dmaInstance, dmaChannel, majorIteration);

        // Now that the TCD was set up, enable the DSPI Peripheral Hardware request for the
        // RX FIFO
        EDMA_HAL_SetDmaRequestCmd(dmaInstance, (edma_channel_indicator_t)dmaChannel, true);

        // Due to MISRA 11.1 rule:
        // Conversions shall not be performed between a pointer to a function
        // and any type other than an integral type.
        // We first have to typecast the callback function pointer as a uint32_t before typecasting
        // as a void pointer.
        EDMA_DRV_InstallCallback(&dspiState->edmaRxChannel,
                                 DSPI_DRV_EdmaRxCallback,(void *)instance);

        // Enable interrupt
        EDMA_HAL_HTCDSetIntCmd(dmaInstance, dmaChannel, true);

        // Change DSPI state
        dspiState->receiveBuffer = receiveBuffer;
    }
    else if (receiveBuffer)
    {
        // Change DSPI state
        dspiState->receiveBuffer = receiveBuffer;

        // Calculate the receive extra bytes
        dspiState->extraReceiveByte = transferByteCount;

        // Slave receive length is less than bits/frame number of bytes
        DSPI_HAL_ClearStatusFlag(baseAddr, kDspiTxComplete);
        DSPI_HAL_SetIntMode(baseAddr, kDspiTxComplete, true);
    }
    else
    {
        // Reception FIFO fill request interrupt disable
        DSPI_HAL_SetRxFifoDrainDmaIntMode(baseAddr, kDspiGenerateIntReq, false);
    }


    if((sendBuffer) && (dspiState->remainingSendByteCount > 0))
    {
        // Check if number of send bytes is smaller than FIFO deepth, enable transmit completed
        // interrupt to know when transferring is done
        if (dspiState->remainingSendByteCount <= (FSL_FEATURE_DSPI_FIFO_SIZEn(instance) * nBytes))
        {
            DSPI_HAL_ClearStatusFlag(baseAddr, kDspiTxComplete);
            DSPI_HAL_SetIntMode(baseAddr, kDspiTxComplete, true);
        }
        else
        {
            DSPI_HAL_SetIntMode(baseAddr, kDspiTxComplete, false);
        }
        // Enable the Transmit FIFO Fill Request as a DMA request
        DSPI_HAL_SetTxFifoFillDmaIntMode(baseAddr, kDspiGenerateDmaReq, true);
    }
    if((receiveBuffer) && (dspiState->remainingReceiveByteCount > 0))
    {
        // Enable the Receive FIFO Drain Request as a DMA request
        DSPI_HAL_SetRxFifoDrainDmaIntMode(baseAddr, kDspiGenerateDmaReq, true);
    }

    // Update state
    dspiState->isTransferInProgress = true;
    dspiState->status = kStatus_DSPI_Busy;

    // Start DSPI transfers, set to running state
    DSPI_HAL_StartTransfer(baseAddr);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : DSPI_DRV_EdmaSlaveAbortTransfer
 * Description   : Abort tranfer
 * Abort data transfer, using after function DSPI_DRV_EdmaSlaveTransfer() to abort
 * transfering data.
 *
 *END**************************************************************************/
dspi_status_t DSPI_DRV_EdmaSlaveAbortTransfer(uint32_t instance)
{
    dspi_edma_slave_state_t * dspiState = (dspi_edma_slave_state_t *)g_dspiStatePtr[instance];

    // Check driver initialized
    if (!dspiState)
    {
        return kStatus_DSPI_NonInit;
    }

    // Check current status
    if (!dspiState->isTransferInProgress)
    {
        return kStatus_DSPI_NoTransferInProgress;
    }

    // Force complete the transfer
    DSPI_DRV_EdmaCompleteTransfer(instance);

    return kStatus_DSPI_Success;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : DSPI_DRV_EdmaCompleteTransfer
 * Description   : Finish the transfer
 * Called when transfer is finished
 *
 *END**************************************************************************/
static void DSPI_DRV_EdmaCompleteTransfer(uint32_t instance)
{
    dspi_edma_slave_state_t * dspiState = (dspi_edma_slave_state_t *)g_dspiStatePtr[instance];
    uint32_t baseAddr = g_dspiBaseAddr[instance];
    uint32_t edmaBaseAddr = VIRTUAL_CHN_TO_EDMA_MODULE_REGBASE(dspiState->edmaRxChannel.channel);
    uint32_t edmaChannel = VIRTUAL_CHN_TO_EDMA_CHN(dspiState->edmaRxChannel.channel);
    uint32_t readData;

    // Disable Rx DMA major loop interrupt
    EDMA_HAL_HTCDSetIntCmd(edmaBaseAddr, edmaChannel, false);

    // Stop Rx DMA channel.
    EDMA_HAL_SetDmaRequestCmd(edmaBaseAddr, (edma_channel_indicator_t)edmaChannel, false);

    edmaBaseAddr = VIRTUAL_CHN_TO_EDMA_MODULE_REGBASE(dspiState->edmaTxChannel.channel);
    edmaChannel = VIRTUAL_CHN_TO_EDMA_CHN(dspiState->edmaTxChannel.channel);

    // Disable Tx DMA major loop interrupt
    EDMA_HAL_HTCDSetIntCmd(edmaBaseAddr, edmaChannel, false);

    // Stop Tx DMA channel.
    EDMA_HAL_SetDmaRequestCmd(edmaBaseAddr, (edma_channel_indicator_t)edmaChannel, false);

    // Stop transfer
    DSPI_HAL_StopTransfer(baseAddr);

    // Disable the transmit FIFO fill request
    DSPI_HAL_SetTxFifoFillDmaIntMode(baseAddr, kDspiGenerateDmaReq, false);
    // Disable the Receive FIFO Drain Request
    DSPI_HAL_SetRxFifoDrainDmaIntMode(baseAddr, kDspiGenerateDmaReq, false);
    // Disable transmit complete interrupt request
    DSPI_HAL_SetIntMode(baseAddr, kDspiTxComplete, false);

    // Update extra receive bytes
    if((dspiState->extraReceiveByte > 0) && (dspiState->receiveBuffer))
    {
        // Read data from FIFO and clear flag
        readData = DSPI_HAL_ReadData(baseAddr);

        // First byte
        dspiState->receiveBuffer[dspiState->remainingReceiveByteCount] = (uint8_t)readData;
        if ((dspiState->extraReceiveByte > 0) &&(--dspiState->extraReceiveByte > 0))
        {
            // Second byte if available
            dspiState->receiveBuffer[dspiState->remainingReceiveByteCount + 1] = (uint8_t)(readData >> 8);
        }

        if ((dspiState->extraReceiveByte > 0) &&(--dspiState->extraReceiveByte > 0))
        {
            // last byte if available
            dspiState->receiveBuffer[dspiState->remainingReceiveByteCount + 2] = (uint8_t)(readData >> 16);
        }
    }

    // Update status
    dspiState->status = kStatus_DSPI_Success;
    dspiState->isTransferInProgress = false;
    dspiState->sendBuffer = NULL;
    dspiState->receiveBuffer = NULL;
    dspiState->remainingSendByteCount = 0;
    dspiState->remainingReceiveByteCount = 0;
    dspiState->extraReceiveByte = 0;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : DSPI_DRV_EdmaSlaveGetTransferStatus
 * Description   : Returns whether the previous transfer has finished yet.
 * When performing an async transfer, the user can call this function to ascertain the state of the
 * current transfer: in progress (or busy) or complete (success). In addition, if the transfer
 * is still in progress, the user can obtain the number of words that have been currently
 * transferred.
 *
 *END**************************************************************************/
dspi_status_t DSPI_DRV_EdmaSlaveGetTransferStatus(uint32_t instance, uint32_t * framesTransferred)
{
    // instantiate local variable of type dspi_edma_slave_state_t and point to global state
    dspi_edma_slave_state_t * dspiState = (dspi_edma_slave_state_t *)g_dspiStatePtr[instance];
    uint32_t baseAddr = g_dspiBaseAddr[instance];

    // Fill in the bytes transferred.
    if (framesTransferred)
    {
        *framesTransferred = DSPI_HAL_GetTransferCount(baseAddr);
    }

    return ((dspiState->isTransferInProgress) ? kStatus_DSPI_Busy : kStatus_DSPI_Success);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : DSPI_DRV_EdmaSlaveTransfer
 * Description   : Transfer data to master
 * Start transfer data to master
 *
 *END**************************************************************************/
dspi_status_t DSPI_DRV_EdmaSlaveTransfer(uint32_t instance,
                                         const uint8_t *sendBuffer,
                                         uint8_t *receiveBuffer,
                                         uint32_t transferByteCount)
{
    dspi_edma_slave_state_t * dspiState = (dspi_edma_slave_state_t *)g_dspiStatePtr[instance];

    assert(instance < SPI_INSTANCE_COUNT);

    // Check if DSPI is not initialized
    if (!dspiState)
    {
        return kStatus_DSPI_NonInit;
    }

    // Check if buffers and length is empty
    if (((!sendBuffer) && (!receiveBuffer)) ||
        (!transferByteCount))
    {
        return kStatus_DSPI_InvalidParameter;
    }

    // Check if driver does not idle
    if (dspiState->status != kStatus_DSPI_Success)
    {
        return dspiState->status;
    }

    dspiState->isSync = false;

    DSPI_DRV_EdmaSlaveStartTransfer(instance, sendBuffer, receiveBuffer, transferByteCount);

