hulei123/git123/apps/bus_pal/MKV46F15/dspi/src/fsl_dspi_edma_slave_driver.c
    return kStatus_DSPI_Success;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : DSPI_DRV_EdmaSlaveTransferBlocking
 * Description   : Transfer data - blocking
 * Transfer data - blocking
 *
 *END**************************************************************************/
dspi_status_t DSPI_DRV_EdmaSlaveTransferBlocking(uint32_t instance,
                                                 const uint8_t *sendBuffer,
                                                 uint8_t *receiveBuffer,
                                                 uint32_t transferByteCount,
                                                 uint32_t timeOut)
{
    dspi_edma_slave_state_t * dspiState = (dspi_edma_slave_state_t *)g_dspiStatePtr[instance];
    dspi_status_t result = kStatus_DSPI_Success;
    event_flags_t setFlags = 0;
    osa_status_t osaStatus = kStatus_OSA_Success;

    // Check if DSPI is not initialized
    if (!dspiState)
    {
        return kStatus_DSPI_NonInit;
    }

    // Check if buffers and length is empty
    if (((!sendBuffer) && (!receiveBuffer)) ||
        (!transferByteCount))
    {
        return kStatus_DSPI_InvalidParameter;
    }

    // Check if driver does not idle
    if (dspiState->status != kStatus_DSPI_Success)
    {
        return dspiState->status;
    }

    dspiState->isSync = true;

    DSPI_DRV_EdmaSlaveStartTransfer(instance, sendBuffer, receiveBuffer, transferByteCount);

    // wait transfer finished
    do
    {
        osaStatus = OSA_EventWait(&dspiState->event, kDspiEdmaTransferDone, true, timeOut, &setFlags);
    } while(osaStatus == kStatus_OSA_Idle);

    // Check status of OSA wait event
    switch (osaStatus)
    {
        case kStatus_OSA_Success:
            result = kStatus_DSPI_Success;
            break;
        case kStatus_OSA_Timeout:
            result = kStatus_DSPI_Timeout;
            break;
        case kStatus_OSA_Error:
        default:
            result = kStatus_DSPI_Error;
            break;
    }

    return result;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : DSPI_DRV_EdmaRxCallback
 * Description   : Callback function, this called when eDMA receiving data
 * completed
 *
 *END**************************************************************************/
static void DSPI_DRV_EdmaRxCallback(void *param, edma_chn_status_t status)
{
    uint32_t instance = (uint32_t)param;
    uint32_t baseAddr = g_dspiBaseAddr[instance];
    dspi_edma_slave_state_t * dspiState = (dspi_edma_slave_state_t *)g_dspiStatePtr[instance];
    uint32_t edmaBaseAddr = VIRTUAL_CHN_TO_EDMA_MODULE_REGBASE(dspiState->edmaRxChannel.channel);
    uint32_t edmaChannel = VIRTUAL_CHN_TO_EDMA_CHN(dspiState->edmaRxChannel.channel);

    // Disable DMA major loop interrupt
    EDMA_HAL_HTCDSetIntCmd(edmaBaseAddr, edmaChannel, false);

    // Stop DMA channel.
    EDMA_HAL_SetDmaRequestCmd(edmaBaseAddr, (edma_channel_indicator_t)edmaChannel, false);

    // Disable Rx Fifo drain interrupt
    DSPI_HAL_SetRxFifoDrainDmaIntMode(baseAddr, kDspiGenerateDmaReq, false);

    // If transmission completed, stop the transferring
    if ((dspiState->isTransferInProgress) &&
        (dspiState->remainingSendByteCount <= 0) &&
        (dspiState->extraReceiveByte == 0))
    {
        DSPI_DRV_EdmaCompleteTransfer(instance);

        // Notify event
        if(dspiState->isSync)
        {
            OSA_EventSet(&dspiState->event, kDspiEdmaTransferDone);
        }
    }
    else if (dspiState->extraReceiveByte != 0)
    {
        // Enable transmit complete interrupt
        DSPI_HAL_ClearStatusFlag(baseAddr, kDspiTxComplete);
        DSPI_HAL_SetIntMode(baseAddr, kDspiTxComplete, true);
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : DSPI_DRV_EdmaTxCallback
 * Description   : Callback function, this called when eDMA transmitting data
 * completed
 *
 *END**************************************************************************/
static void DSPI_DRV_EdmaTxCallback(void *param, edma_chn_status_t status)
{
    uint32_t instance = (uint32_t)param;
    uint32_t baseAddr = g_dspiBaseAddr[instance];
    dspi_edma_slave_state_t * dspiState = (dspi_edma_slave_state_t *)g_dspiStatePtr[instance];
    uint32_t edmaBaseAddr = VIRTUAL_CHN_TO_EDMA_MODULE_REGBASE(dspiState->edmaTxChannel.channel);
    uint32_t edmaChannel = VIRTUAL_CHN_TO_EDMA_CHN(dspiState->edmaTxChannel.channel);
    uint8_t nBytes;

    nBytes = dspiState->bitsPerFrame / 8;
    if (dspiState->bitsPerFrame % 8 != 0)
    {
        nBytes += 1;
    }

    // Disable DMA major loop interrupt
    EDMA_HAL_HTCDSetIntCmd(edmaBaseAddr, edmaChannel, false);

    // Stop DMA channel.
    EDMA_HAL_SetDmaRequestCmd(edmaBaseAddr, (edma_channel_indicator_t)edmaChannel, false);

    // Disable Tx Fifo fill interrupt
    DSPI_HAL_SetTxFifoFillDmaIntMode(baseAddr, kDspiGenerateDmaReq, false);

    // Check if send bytes count is greater than FIFO size, update this count and enable
    // transmit completed interrupt.
    if (dspiState->remainingSendByteCount > (FSL_FEATURE_DSPI_FIFO_SIZEn(instance) * nBytes))
    {
        // Enable transmit complete interrupt
        DSPI_HAL_ClearStatusFlag(baseAddr, kDspiTxComplete);
        DSPI_HAL_SetIntMode(baseAddr, kDspiTxComplete, true);
    }
}

/*!
 * @brief DSPI slave interrupt handler
 * @details This function is DSPI slave interrupt handler using eDMA mechanism. The
 *          pupose of this interrupt handler is indicates when the transfer is really
 *          finished. The eDMA only used to copy data from/to RX FIFO/TX FIFO, but it
 *          not sure the data was transmitted to the master. So must have to enable
 *          this interrupt to do it. This interrupt only be enabled when the last
 *          four FIFO will be transmitted.
 *
 * @param instance The SPI number
 */
void DSPI_DRV_EdmaSlaveIRQHandler(uint32_t instance)
{
    uint32_t baseAddr = g_dspiBaseAddr[instance];
    dspi_edma_slave_state_t * dspiState = (dspi_edma_slave_state_t *)g_dspiStatePtr[instance];
    uint8_t nBytes;

    nBytes = dspiState->bitsPerFrame / 8;
    if (dspiState->bitsPerFrame % 8 != 0)
    {
        nBytes += 1;
    }

    // Catch Tx complete interrupt
    if ((DSPI_HAL_GetIntMode(baseAddr, kDspiTxComplete)) &&
        (DSPI_HAL_GetStatusFlag(baseAddr, kDspiTxComplete)))
    {
        // Clear this flag first
        DSPI_HAL_ClearStatusFlag(baseAddr, kDspiTxComplete);

        // Check if number of transfered bytes is greater or equals user request
        if(dspiState->remainingSendByteCount <= (DSPI_HAL_GetTransferCount(baseAddr) * nBytes))
        {
            // Complete the transfer
            DSPI_DRV_EdmaCompleteTransfer(instance);
            // Notify to wait task
            if(dspiState->isSync)
            {
                OSA_EventSet(&dspiState->event, kDspiEdmaTransferDone);
            }
        }
    }
}

/*******************************************************************************
 * EOF
 ******************************************************************************/
